notes/meeting_2021apr25.org
* meeting notes Apr 25, 2021
** agenda stuff
*** paul evans (leonerd) talk from 2020
**** https://ftp.osuosl.org/pub/fosdem/2021/D.perl/perl_in_2025.mp4
**** my local copy:
/home/doom/Dust/Video/Tech/paul_evans-future_of_perl_in_2025-2021feb06.mp4
**** summary: ways to make perl more raku-like in the absence of a type system
***** match/case ideas are good
****** restricting to constants is un-perlish, though
****** maybe:  
perserve given/when, with default to "smartmatch",
but you get match/case behavior when you specify a comparison
***** some slides: /home/doom/End/Cave/Perl6/Ore/Leonerd/leonerd-match_case_idea-01.png

*** some silly printf experiments (perl5)

*** raku idioms
/home/doom/End/Cave/Ice/Xtal/Perl6/idioms.org

*** data container class

** announcement
*** for next week, could everyone install git if they haven't already?

