notes/meeting_2021apr25.md
- [meeting notes Apr 25, 2021](#orgbfc87c9)
  - [agenda stuff](#org0722346)
    - [paul evans (leonerd) talk from 2020](#orgb12f0c6)
    - [some silly printf experiments (perl5)](#org1a9c535)
    - [raku idioms](#orga4ffab9)
    - [data container class](#org75aabc5)
  - [announcement](#org2e2e922)
    - [for next week, could everyone install git if they haven't already?](#org5327866)


<a id="orgbfc87c9"></a>

# meeting notes Apr 25, 2021


<a id="org0722346"></a>

## agenda stuff


<a id="orgb12f0c6"></a>

### paul evans (leonerd) talk from 2020

1.  <https://ftp.osuosl.org/pub/fosdem/2021/D.perl/perl_in_2025.mp4>

2.  my local copy:

    /home/doom/Dust/Video/Tech/paul<sub>evans</sub>-future<sub>of</sub><sub>perl</sub><sub>in</sub><sub>2025</sub>-2021feb06.mp4

3.  summary: ways to make perl more raku-like in the absence of a type system

    1.  match/case ideas are good
    
        1.  restricting to constants is un-perlish, though
        
        2.  maybe:
        
            perserve given/when, with default to "smartmatch", but you get match/case behavior when you specify a comparison
    
    2.  some slides: /home/doom/End/Cave/Perl6/Ore/Leonerd/leonerd-match<sub>case</sub><sub>idea</sub>-01.png


<a id="org1a9c535"></a>

### some silly printf experiments (perl5)


<a id="orga4ffab9"></a>

### raku idioms

/home/doom/End/Cave/Ice/Xtal/Perl6/idioms.org


<a id="org75aabc5"></a>

### data container class


<a id="org2e2e922"></a>

## announcement


<a id="org5327866"></a>

### for next week, could everyone install git if they haven't already?
